<?xml version="1.0"?>
<net name="0003_EmoNet_ResNet10" version="6" batch="1">
	<layers>
		<layer name="data" type="Input" precision="FP32" id="0">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul_1152/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="1">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<biases offset="0" size="12" />
				<weights offset="12" size="12" />
			</blobs>
		</layer>
		<layer name="Convolution1" type="Convolution" precision="FP32" id="2">
			<data dilations="1,1" group="1" kernel="7,7" output="64" pads_begin="3,3" pads_end="3,3" quantization_level="FP32" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="24" size="256" />
				<weights offset="280" size="37632" />
			</blobs>
		</layer>
		<layer name="ReLU1" type="ReLU" precision="FP32" id="3">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="Pooling1" type="Pooling" precision="FP32" id="4">
			<data exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer name="Convolution2" type="Convolution" precision="FP32" id="5">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" quantization_level="FP32" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<biases offset="37912" size="256" />
				<weights offset="38168" size="147456" />
			</blobs>
		</layer>
		<layer name="ReLU2" type="ReLU" precision="FP32" id="6">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer name="Convolution3" type="Convolution" precision="FP32" id="7">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="185624" size="147456" />
			</blobs>
		</layer>
		<layer name="Eltwise1" type="Eltwise" precision="FP32" id="8">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul_1143/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="9">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<biases offset="333080" size="256" />
				<weights offset="333336" size="256" />
			</blobs>
		</layer>
		<layer name="ReLU3" type="ReLU" precision="FP32" id="10">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer name="Convolution6" type="Convolution" precision="FP32" id="11">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<weights offset="333592" size="32768" />
			</blobs>
		</layer>
		<layer name="Convolution4" type="Convolution" precision="FP32" id="12">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<biases offset="366360" size="512" />
				<weights offset="366872" size="294912" />
			</blobs>
		</layer>
		<layer name="ReLU4" type="ReLU" precision="FP32" id="13">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer name="Convolution5" type="Convolution" precision="FP32" id="14">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<weights offset="661784" size="589824" />
			</blobs>
		</layer>
		<layer name="Eltwise2" type="Eltwise" precision="FP32" id="15">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul_1146/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="16">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1251608" size="512" />
				<weights offset="1252120" size="512" />
			</blobs>
		</layer>
		<layer name="ReLU5" type="ReLU" precision="FP32" id="17">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer name="Convolution9" type="Convolution" precision="FP32" id="18">
			<data dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1252632" size="131072" />
			</blobs>
		</layer>
		<layer name="Convolution7" type="Convolution" precision="FP32" id="19">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1383704" size="1024" />
				<weights offset="1384728" size="1179648" />
			</blobs>
		</layer>
		<layer name="ReLU6" type="ReLU" precision="FP32" id="20">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer name="Convolution8" type="Convolution" precision="FP32" id="21">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2564376" size="2359296" />
			</blobs>
		</layer>
		<layer name="Eltwise3" type="Eltwise" precision="FP32" id="22">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul_1149/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="23">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="4923672" size="1024" />
				<weights offset="4924696" size="1024" />
			</blobs>
		</layer>
		<layer name="ReLU7" type="ReLU" precision="FP32" id="24">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer name="Convolution12" type="Convolution" precision="FP32" id="25">
			<data dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4925720" size="262144" />
			</blobs>
		</layer>
		<layer name="Convolution10" type="Convolution" precision="FP32" id="26">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<biases offset="5187864" size="1024" />
				<weights offset="5188888" size="2359296" />
			</blobs>
		</layer>
		<layer name="ReLU8" type="ReLU" precision="FP32" id="27">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer name="Convolution11" type="Convolution" precision="FP32" id="28">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7548184" size="2359296" />
			</blobs>
		</layer>
		<layer name="Eltwise4" type="Eltwise" precision="FP32" id="29">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul_1164/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="30">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<biases offset="9907480" size="1024" />
				<weights offset="9908504" size="1024" />
			</blobs>
		</layer>
		<layer name="ReLU9" type="ReLU" precision="FP32" id="31">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer name="emotion5_conv1" type="Convolution" precision="FP32" id="32">
			<data dilations="1,1" group="1" kernel="2,2" output="5" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>5</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<biases offset="9909528" size="20" />
				<weights offset="9909548" size="20480" />
			</blobs>
		</layer>
		<layer name="prob_emotion" type="SoftMax" precision="FP32" id="33">
			<data axis="1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>5</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0" />
		<edge from-layer="1" from-port="1" to-layer="2" to-port="0" />
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0" />
		<edge from-layer="3" from-port="1" to-layer="4" to-port="0" />
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0" />
		<edge from-layer="4" from-port="1" to-layer="8" to-port="1" />
		<edge from-layer="5" from-port="1" to-layer="6" to-port="0" />
		<edge from-layer="6" from-port="1" to-layer="7" to-port="0" />
		<edge from-layer="7" from-port="1" to-layer="8" to-port="0" />
		<edge from-layer="8" from-port="2" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="10" to-port="0" />
		<edge from-layer="10" from-port="1" to-layer="12" to-port="0" />
		<edge from-layer="10" from-port="1" to-layer="11" to-port="0" />
		<edge from-layer="11" from-port="1" to-layer="15" to-port="1" />
		<edge from-layer="12" from-port="1" to-layer="13" to-port="0" />
		<edge from-layer="13" from-port="1" to-layer="14" to-port="0" />
		<edge from-layer="14" from-port="1" to-layer="15" to-port="0" />
		<edge from-layer="15" from-port="2" to-layer="16" to-port="0" />
		<edge from-layer="16" from-port="1" to-layer="17" to-port="0" />
		<edge from-layer="17" from-port="1" to-layer="19" to-port="0" />
		<edge from-layer="17" from-port="1" to-layer="18" to-port="0" />
		<edge from-layer="18" from-port="1" to-layer="22" to-port="1" />
		<edge from-layer="19" from-port="1" to-layer="20" to-port="0" />
		<edge from-layer="20" from-port="1" to-layer="21" to-port="0" />
		<edge from-layer="21" from-port="1" to-layer="22" to-port="0" />
		<edge from-layer="22" from-port="2" to-layer="23" to-port="0" />
		<edge from-layer="23" from-port="1" to-layer="24" to-port="0" />
		<edge from-layer="24" from-port="1" to-layer="26" to-port="0" />
		<edge from-layer="24" from-port="1" to-layer="25" to-port="0" />
		<edge from-layer="25" from-port="1" to-layer="29" to-port="1" />
		<edge from-layer="26" from-port="1" to-layer="27" to-port="0" />
		<edge from-layer="27" from-port="1" to-layer="28" to-port="0" />
		<edge from-layer="28" from-port="1" to-layer="29" to-port="0" />
		<edge from-layer="29" from-port="2" to-layer="30" to-port="0" />
		<edge from-layer="30" from-port="1" to-layer="31" to-port="0" />
		<edge from-layer="31" from-port="1" to-layer="32" to-port="0" />
		<edge from-layer="32" from-port="1" to-layer="33" to-port="0" />
	</edges>
	<statistics>
		<layer>
			<name>Convolution1</name>
			<min>-0.530787, -0.000000, -0.633362, -0.537035, -0.000000, -0.503060, -0.785479, -0.000000, -0.000000, -0.557307, -0.000000, -0.997122, -0.000000, -0.659997, -0.570720, -0.000000, 0.018209, -0.928849, -0.000000, -0.820777, -0.553247, -0.000000, -0.658472, -0.533212, -0.380964, -0.857587, -0.000000, -0.682928, -0.666193, -0.729053, -0.000000, -0.000000, -0.556319, -0.684556, -0.000000, -0.000000, -0.000000, -0.585882, -0.507213, -0.000000, -0.681932, -0.647553, -0.000000, -0.528246, -0.416620, -0.694248, -0.000010, -0.746558, -0.369626, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.433055, -0.000000, -0.000000, -0.500226, -0.000000, -0.758026, -0.000000, -0.000000, -0.000000, -0.000000</min>
			<max>0.576486, -0.000000, 0.724104, 0.657419, -0.000000, 0.576147, 0.892189, -0.000000, -0.000000, 0.617604, -0.000000, 1.052032, -0.000000, 0.715253, 0.559882, -0.000000, 0.478657, 0.950356, -0.000000, 0.832211, 0.629350, -0.000000, 0.697295, 0.569199, 0.337865, 0.923448, -0.000000, 0.687909, 0.700052, 0.742363, -0.000000, -0.000000, 0.650422, 0.309471, -0.000000, -0.000000, -0.000000, 0.672354, 0.536634, -0.000000, 0.864071, 0.708461, -0.000000, 0.603512, 0.501343, 0.667218, -0.000004, 0.764522, 0.437263, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, 0.757852, -0.000000, -0.000000, 0.532373, -0.000000, 0.765433, -0.000000, -0.000000, -0.000000, -0.000000</max>
		</layer>
		<layer>
			<name>Convolution10</name>
			<min>-0.308805, -0.242828, -0.051852, -0.469592, -0.382952, -0.179937, -0.573767, -0.038948, -0.218930, -0.090995, -0.266982, -0.194609, -0.216366, -0.140736, -0.118998, -0.147156, -0.535446, -0.112933, -0.214295, -0.186089, -0.218393, -0.561471, -0.086057, -0.167348, -0.142412, -0.193559, -0.323649, -0.357999, -0.085874, -0.192361, -0.191729, -0.358838, -0.317499, -0.095659, -0.306543, -0.362889, -0.110264, -0.052042, -0.281710, -0.406258, -0.175193, -0.327434, -0.641966, -0.068370, -0.318354, -0.256265, -0.033282, -0.337147, -0.420424, -0.285579, -0.111720, -0.259099, -0.355468, -0.433244, -0.062016, -0.267708, -0.141880, -0.165912, -0.254005, -0.351840, -0.333663, -0.165799, -0.084639, -0.601151, -0.468502, -0.333587, -0.381436, -0.207378, -0.146061, -0.070496, -0.245189, -0.487763, -0.574666, -0.103302, -0.202871, -0.272436, -0.197673, -0.197348, -0.465842, -0.185828, -0.165878, -0.101370, -0.263973, -0.254414, -0.215821, -0.266862, -0.229034, -0.194008, -0.213648, -0.439675, -0.213831, -0.414019, -0.359344, -0.337251, -0.027877, -0.378966, -0.220027, -0.220281, -0.346767, -0.378398, -0.493435, -0.399237, -0.247656, -0.219558, -0.181135, -0.243365, -0.101647, -0.321417, -0.473688, -0.349886, -0.150335, -0.365990, -0.352729, -0.296802, -0.167783, -0.375519, -0.319271, -0.128853, -0.392782, -0.146020, -0.359278, -0.163944, -0.171564, -0.219886, -0.138238, -0.095463, -0.076485, -0.521691, -0.153752, -0.252848, -0.122786, -0.128336, -0.226628, -0.392167, -0.212339, -0.163397, -0.177211, -0.159988, -0.195126, -0.344531, -0.307385, -0.135307, -0.102953, -0.163650, -0.178604, -0.125817, -0.183209, -0.575402, -0.373601, -0.624298, -0.213515, -0.154011, -0.317376, -0.112325, -0.421150, -0.366938, -0.048750, -0.074285, -0.809489, -0.336599, -0.115551, -0.189823, -0.300691, -0.216628, -0.193094, -0.349897, -0.100414, -0.088195, -0.127117, -0.146558, -0.168454, -0.200623, -0.264943, -0.316840, -0.441131, -0.380312, -0.154753, -0.387699, -0.134618, -0.288057, -0.193856, -0.123910, -0.167468, -0.134682, -0.325077, -0.375905, -0.341151, -0.131414, -0.266234, -0.572924, -0.160858, -0.323232, -0.343906, -0.294939, -0.257518, -0.166530, -0.228612, -0.328252, -0.330608, -0.427557, -0.390190, -0.373405, -0.182088, -0.136988, -0.182363, -0.099891, -0.200906, -0.383118, -0.216362, -0.121102, -0.185319, -0.145392, -0.369352, -0.235510, -0.168581, -0.334419, -0.069227, -0.139013, -0.232873, -0.298145, -0.302670, -0.219239, -0.123913, -0.547513, -0.153545, -0.328558, -0.230559, -0.065137, -0.377622, -0.465167, -0.102192, -0.328831, -0.480066, -0.170395, -0.148557, -0.256367, -0.211961, -0.190840, -0.120705, -0.386401, -0.054920, -0.421974, -0.298692, -0.092720, -0.214621, -0.301686, -0.347552, -0.261833, -0.365650, -0.236651, -0.162791, -0.166609, -0.317132, -0.343854, -0.169984, -0.236104</min>
			<max>0.261298, 0.232649, 0.034186, 0.173977, 0.173293, 0.128337, 0.162270, 0.036881, 0.244088, 0.123746, 0.130429, 0.225782, 0.106138, 0.109932, 0.058989, 0.082081, 0.326589, 0.153352, 0.140859, 0.115631, 0.193723, 0.113843, 0.073512, 0.136588, 0.111799, 0.111212, 0.180718, 0.234979, 0.049337, 0.151970, 0.094375, 0.165676, 0.186031, 0.131812, 0.140194, 0.348963, 0.100151, 0.038193, 0.136289, 0.213050, 0.137037, 0.207334, 0.162198, 0.035617, 0.250381, 0.285527, 0.028917, 0.114675, 0.175319, 0.228615, 0.083364, 0.124843, 0.186130, 0.274385, 0.037212, 0.125413, 0.109078, 0.064031, 0.112668, 0.132338, 0.171590, 0.092855, 0.115477, 0.154381, 0.208971, 0.165051, 0.177364, 0.117384, 0.094484, 0.088819, 0.104676, 0.148523, 0.202108, 0.138504, 0.113859, 0.136470, 0.101841, 0.160137, 0.217056, 0.279518, 0.137456, 0.140713, 0.201258, 0.300349, 0.090594, 0.138993, 0.092872, 0.118829, 0.106435, 0.207617, 0.112417, 0.261375, 0.217076, 0.200576, 0.022565, 0.119480, 0.193227, 0.109672, 0.220006, 0.164243, 0.584582, 0.117634, 0.188210, 0.068481, 0.231193, 0.112205, 0.056766, 0.170754, 0.443500, 0.237624, 0.102504, 0.242603, 0.234737, 0.113592, 0.154648, 0.196039, 0.152113, 0.112862, 0.136470, 0.068672, 0.211891, 0.120795, 0.231306, 0.208306, 0.099230, 0.053539, 0.080347, 0.399262, 0.045068, 0.179282, 0.088945, 0.099536, 0.110769, 0.154121, 0.163921, 0.108268, 0.089289, 0.122899, 0.125566, 0.121528, 0.127065, 0.151548, 0.100244, 0.080327, 0.065124, 0.110685, 0.153772, 0.218903, 0.191305, 0.216242, 0.094193, 0.127415, 0.210654, 0.084477, 0.171117, 0.207471, 0.065569, 0.045564, 0.334360, 0.104539, 0.113449, 0.192525, 0.171669, 0.104133, 0.122738, 0.119902, 0.058628, 0.063675, 0.059029, 0.164699, 0.150119, 0.149224, 0.287826, 0.174306, 0.134978, 0.165754, 0.199985, 0.130618, 0.067971, 0.247404, 0.164010, 0.080364, 0.191193, 0.095764, 0.200343, 0.174023, 0.157766, 0.056438, 0.185912, 0.154010, 0.154179, 0.331693, 0.118886, 0.163206, 0.238556, 0.114620, 0.126186, 0.062813, 0.265259, 0.207594, 0.113660, 0.157939, 0.203111, 0.098599, 0.236467, 0.122727, 0.174085, 0.236426, 0.113790, 0.132886, 0.181783, 0.057470, 0.148401, 0.161243, 0.149422, 0.205337, 0.056142, 0.185220, 0.115544, 0.153242, 0.267596, 0.257947, 0.092736, 0.409842, 0.107825, 0.249038, 0.086088, 0.045209, 0.230575, 0.303664, 0.073124, 0.229786, 0.498331, 0.172276, 0.113624, 0.157536, 0.119678, 0.195810, 0.099889, 0.262329, 0.082705, 0.218159, 0.175051, 0.048551, 0.140462, 0.150240, 0.127339, 0.187005, 0.182750, 0.171338, 0.144834, 0.144324, 0.226588, 0.190742, 0.073959, 0.196993</max>
		</layer>
		<layer>
			<name>Convolution11</name>
			<min>-0.041332, -0.046901, -0.034266, -0.013221, -0.029050, -0.032297, -0.025698, -0.047299, -0.035894, -0.038720, -0.050424, -0.030361, -0.043298, 0.005316, -0.028821, -0.029001, -0.036715, -0.047148, -0.036243, -0.037807, -0.048476, -0.042911, -0.032480, -0.035404, -0.031292, -0.033246, -0.036919, -0.044190, -0.035800, -0.040498, -0.031766, -0.038252, -0.041690, -0.037949, -0.030330, -0.024702, -0.028657, -0.044167, -0.045273, -0.034628, -0.045083, -0.042052, -0.032389, -0.041921, -0.034056, -0.034728, -0.029851, -0.029668, -0.029999, -0.042834, -0.042042, -0.046933, -0.040174, -0.031889, -0.046068, -0.024189, -0.038769, -0.035613, -0.038530, -0.037758, -0.036315, -0.040362, -0.033819, -0.041166, -0.038525, -0.044052, -0.041638, -0.034593, -0.046983, -0.039961, -0.027820, -0.027389, -0.041180, -0.041329, -0.033316, -0.033488, -0.039582, -0.029950, -0.027741, -0.038286, -0.038319, -0.033076, -0.049462, -0.033402, -0.038266, -0.034976, -0.035745, -0.035219, -0.031428, -0.032929, -0.042998, -0.042676, -0.045859, -0.036892, -0.037576, -0.031894, -0.032033, -0.036388, -0.044907, -0.031419, -0.035771, -0.037333, -0.036246, -0.034951, -0.038224, -0.035637, -0.044780, -0.030742, -0.042799, -0.042260, -0.045702, -0.042804, -0.043032, -0.027432, -0.045058, -0.049633, -0.028015, -0.030619, -0.040862, -0.033714, -0.028207, -0.037548, -0.033346, -0.035014, -0.034543, -0.044428, -0.039754, -0.034665, -0.041960, -0.027406, -0.030842, -0.029626, -0.027281, -0.031424, -0.035422, -0.034852, -0.030384, -0.028333, -0.033208, -0.028792, -0.037931, -0.042127, -0.044540, -0.040498, -0.051408, -0.043490, -0.045594, -0.030352, -0.037113, -0.025636, -0.036963, -0.034261, -0.036044, -0.033845, -0.034320, -0.033498, -0.040533, -0.037091, -0.042070, -0.035950, -0.041488, -0.015997, -0.029112, -0.036657, -0.020408, -0.027300, -0.037612, -0.046868, -0.033486, -0.048413, -0.027573, -0.037760, -0.030287, -0.035947, -0.036438, -0.044992, -0.020932, -0.033398, -0.037842, -0.031306, -0.036324, -0.048039, -0.030839, -0.031089, -0.035391, -0.030529, -0.033082, -0.034121, -0.042655, -0.037603, -0.035746, -0.035891, -0.034241, -0.025834, -0.038343, -0.038854, -0.043710, -0.047974, -0.046737, -0.044674, -0.040761, -0.039312, -0.037080, -0.035194, -0.029722, -0.046321, -0.037162, -0.031688, -0.029757, -0.044438, -0.031222, -0.036091, -0.041185, -0.033947, -0.049464, -0.046045, -0.039911, -0.041644, -0.045307, -0.039605, -0.032075, -0.035963, -0.032685, -0.031136, -0.034091, -0.035074, -0.040067, -0.037245, -0.048482, -0.046086, -0.037288, -0.046203, -0.035975, -0.036279, -0.033829, -0.033693, -0.035905, -0.034168, -0.038053, -0.051263, -0.038748, -0.028402, -0.022672, -0.043627, -0.036683, -0.043844, -0.046759, -0.038270, -0.027567, -0.037893, -0.037716, -0.032829, -0.045303, -0.038966, -0.049878, -0.031356</min>
			<max>0.033864, 0.037371, 0.038064, 0.041888, 0.048173, 0.034058, 0.037709, 0.033154, 0.027638, 0.045722, 0.019845, 0.050774, 0.044334, 0.034437, 0.045787, 0.036729, 0.021690, 0.021016, 0.024715, 0.030683, 0.016516, 0.027154, 0.036331, 0.045478, 0.037142, 0.026279, 0.036095, 0.039859, 0.038638, 0.035292, 0.034436, 0.034648, 0.019268, 0.029424, 0.043824, 0.061957, 0.051331, 0.016802, 0.017183, 0.034037, 0.039846, 0.030349, 0.051532, 0.025280, 0.046734, 0.046222, 0.044149, 0.046984, 0.032799, 0.025793, 0.050430, 0.028416, 0.018273, 0.043237, 0.029501, 0.038955, 0.031654, 0.023735, 0.032809, 0.045824, 0.040551, 0.037348, 0.044552, 0.037413, 0.038176, 0.034394, 0.030626, 0.038975, 0.014049, 0.039563, 0.034314, 0.036947, 0.040353, 0.033301, 0.033443, 0.032918, 0.035027, 0.049301, 0.033580, 0.032937, 0.028792, 0.045616, 0.024742, 0.045022, 0.025360, 0.036124, 0.032443, 0.034096, 0.028574, 0.053453, 0.017236, 0.034913, 0.025227, 0.035898, 0.033670, 0.040377, 0.046685, 0.037907, 0.032424, 0.044392, 0.035266, 0.039146, 0.040821, 0.040175, 0.038948, 0.038084, 0.029915, 0.045985, 0.025645, 0.028772, 0.031715, 0.030263, 0.022721, 0.048659, 0.042710, 0.029939, 0.039833, 0.040193, 0.033184, 0.043969, 0.048162, 0.042483, 0.026339, 0.043643, 0.031579, 0.038661, 0.038682, 0.045834, 0.020019, 0.027722, 0.026324, 0.038781, 0.050044, 0.043529, 0.035374, 0.030536, 0.026827, 0.044158, 0.038930, 0.047125, 0.039937, 0.018057, 0.030289, 0.028480, 0.019631, 0.033577, 0.031776, 0.034467, 0.036651, 0.043506, 0.026524, 0.039612, 0.034127, 0.035753, 0.031628, 0.050235, 0.041535, 0.040861, 0.032355, 0.033878, 0.039211, 0.050087, 0.036835, 0.032077, 0.048324, 0.034951, 0.039969, 0.030589, 0.039012, 0.035240, 0.037947, 0.031495, 0.042090, 0.037496, 0.041738, 0.030375, 0.050636, 0.031160, 0.048369, 0.065137, 0.052457, 0.023897, 0.033887, 0.039513, 0.036237, 0.039055, 0.043698, 0.036690, 0.031262, 0.030799, 0.031739, 0.031254, 0.043272, 0.037942, 0.034745, 0.026323, 0.039590, 0.023321, 0.009943, 0.040179, 0.028822, 0.035714, 0.031671, 0.023997, 0.037043, 0.022801, 0.028476, 0.039478, 0.044093, 0.021870, 0.041937, 0.036638, 0.017045, 0.032245, 0.025236, 0.025140, 0.047054, 0.038855, 0.033188, 0.036039, 0.035494, 0.036077, 0.041324, 0.045605, 0.040345, 0.035431, 0.027484, 0.034226, 0.017529, 0.020257, 0.031884, 0.008218, 0.042398, 0.038253, 0.031614, 0.059518, 0.030743, 0.037755, 0.028484, 0.033004, 0.029563, 0.027538, 0.058743, 0.029692, 0.035138, 0.040051, 0.030142, 0.046555, 0.037153, 0.045078, 0.029611, 0.043539, 0.033498, 0.027837, 0.010772, 0.047509</max>
		</layer>
		<layer>
			<name>Convolution12</name>
			<min>-0.010285, -0.011647, -0.010709, -0.006363, -0.007635, -0.010229, -0.014685, -0.009876, -0.010493, -0.017944, -0.008297, -0.010637, -0.018246, -0.000353, -0.014869, -0.011753, -0.011362, -0.011540, -0.013792, -0.010868, -0.007730, -0.012787, -0.009417, -0.016770, -0.007968, -0.012037, -0.012160, -0.006682, -0.014446, -0.011743, -0.012567, -0.011741, -0.008979, -0.015356, -0.015718, -0.010601, -0.010032, -0.012740, -0.006662, -0.009421, -0.011840, -0.009853, -0.009298, -0.011963, -0.010382, -0.010816, -0.013371, -0.011271, -0.007577, -0.014381, -0.011436, -0.012650, -0.012912, -0.008301, -0.014662, -0.008538, -0.011847, -0.010097, -0.012225, -0.007650, -0.013454, -0.008332, -0.009892, -0.013518, -0.014184, -0.011089, -0.016793, -0.012455, -0.012947, -0.010641, -0.011822, -0.008647, -0.013508, -0.012464, -0.016887, -0.013487, -0.014729, -0.014240, -0.012714, -0.015236, -0.016061, -0.014019, -0.010251, -0.010427, -0.012111, -0.016271, -0.015235, -0.007384, -0.015017, -0.009178, -0.018367, -0.012645, -0.011284, -0.010873, -0.013508, -0.011511, -0.006698, -0.015224, -0.008735, -0.013859, -0.013949, -0.016912, -0.013429, -0.005347, -0.016167, -0.015453, -0.011337, -0.012229, -0.013905, -0.014073, -0.011683, -0.007747, -0.013135, -0.005085, -0.014524, -0.012651, -0.008101, -0.008336, -0.011374, -0.017051, -0.013147, -0.017951, -0.012243, -0.013343, -0.009696, -0.013974, -0.016504, -0.011978, -0.013191, -0.014430, -0.010086, -0.011778, -0.006824, -0.017556, -0.011084, -0.010137, -0.010380, -0.016616, -0.004121, -0.008689, -0.009651, -0.006795, -0.015782, -0.006165, -0.008175, -0.010822, -0.016073, -0.012399, -0.014662, -0.014753, -0.009415, -0.008001, -0.012534, -0.009246, -0.010784, -0.011696, -0.012412, -0.007073, -0.015434, -0.012669, -0.018015, -0.011257, -0.009681, -0.008039, -0.011652, -0.014972, -0.016346, -0.014867, -0.009387, -0.008068, -0.007469, -0.012358, -0.015319, -0.016476, -0.013075, -0.017696, -0.010768, -0.013269, -0.006910, -0.007535, -0.011037, -0.009070, -0.010475, -0.004680, -0.012938, -0.012261, -0.012721, -0.011075, -0.012417, -0.012882, -0.010271, -0.013570, -0.008184, -0.011189, -0.015180, -0.012073, -0.009352, -0.013160, -0.006957, -0.012683, -0.013429, -0.013421, -0.014319, -0.008592, -0.012618, -0.009444, -0.008290, -0.016000, -0.020369, -0.012074, -0.014748, -0.011636, -0.007383, -0.015132, -0.014560, -0.012624, -0.013674, -0.013432, -0.012238, -0.016545, -0.014463, -0.009999, -0.011644, -0.013067, -0.010263, -0.014263, -0.013987, -0.013398, -0.009844, -0.012085, -0.013507, -0.004725, -0.011210, -0.009752, -0.012560, -0.005182, -0.008426, -0.012711, -0.013906, -0.020190, -0.009753, -0.012551, -0.013563, -0.017732, -0.012842, -0.009564, -0.014479, -0.011754, -0.015505, -0.010971, -0.008918, -0.019047, -0.009747, -0.004566, -0.009373, -0.011693</min>
			<max>0.009958, 0.004923, 0.015098, 0.013780, 0.015411, 0.015140, 0.011822, 0.007928, 0.009559, 0.011199, 0.007192, 0.012311, 0.013012, 0.005637, 0.013083, 0.013165, 0.007137, 0.005849, 0.010905, 0.015221, 0.008921, 0.006317, 0.012710, 0.015398, 0.020381, 0.013662, 0.009874, 0.011825, 0.007883, 0.010001, 0.014724, 0.015320, 0.006903, 0.012140, 0.022228, 0.016632, 0.011256, 0.005683, 0.003646, 0.011305, 0.014971, 0.014752, 0.016639, 0.008609, 0.014893, 0.009016, 0.011012, 0.013636, 0.012024, 0.018754, 0.009152, 0.012482, 0.009994, 0.010689, 0.006802, 0.005816, 0.017128, 0.010060, 0.008661, 0.005009, 0.009496, 0.011661, 0.011019, 0.014068, 0.017115, 0.013801, 0.015882, 0.007162, 0.002216, 0.011696, 0.013190, 0.014087, 0.010847, 0.010442, 0.007464, 0.015595, 0.009277, 0.010734, 0.009487, 0.015122, 0.013517, 0.025962, 0.008793, 0.015782, 0.004478, 0.014500, 0.013995, 0.014926, 0.007589, 0.009727, 0.010438, 0.006075, 0.010914, 0.016814, 0.021158, 0.016597, 0.017054, 0.009467, 0.009029, 0.011267, 0.009419, 0.014723, 0.019681, 0.020155, 0.010229, 0.021154, 0.010837, 0.017650, 0.012089, 0.015734, 0.010657, 0.011301, 0.012757, 0.016546, 0.011502, 0.011444, 0.011487, 0.010350, 0.011241, 0.011405, 0.014696, 0.014676, 0.016916, 0.009410, 0.016999, 0.018311, 0.013111, 0.008635, 0.007400, 0.011147, 0.009663, 0.013673, 0.015953, 0.016838, 0.003494, 0.007708, 0.010507, 0.014712, 0.015002, 0.012284, 0.017981, 0.008193, 0.010189, 0.011126, 0.010035, 0.008162, 0.014475, 0.011909, 0.017817, 0.008401, 0.008878, 0.011194, 0.015257, 0.013917, 0.012422, 0.015296, 0.007471, 0.011059, 0.006308, 0.010744, 0.012702, 0.016942, 0.013489, 0.010475, 0.014065, 0.017931, 0.006752, 0.003636, 0.013354, 0.004029, 0.011536, 0.008795, 0.012216, 0.010182, 0.010526, 0.006710, 0.016703, 0.010822, 0.012355, 0.016977, 0.018997, 0.008342, 0.009241, 0.015371, 0.008398, 0.009902, 0.008015, 0.014218, 0.011780, 0.014000, 0.015946, 0.012167, 0.016546, 0.011243, 0.012983, 0.008399, 0.015052, 0.016428, 0.007516, 0.010952, 0.012104, 0.008043, 0.009481, 0.011104, 0.007262, 0.004056, 0.010984, 0.009602, 0.013039, 0.003024, 0.011948, 0.004572, 0.014072, 0.012324, 0.010212, 0.005779, 0.011830, 0.012440, 0.007742, 0.012991, 0.009645, 0.004142, 0.010763, 0.014083, 0.012107, 0.014828, 0.010559, 0.015487, 0.005829, 0.009338, 0.009388, 0.006232, 0.018186, 0.007039, 0.010321, 0.013778, 0.010971, 0.016270, 0.009496, 0.006325, 0.007073, 0.010430, 0.013564, 0.002082, 0.014663, 0.009921, 0.009554, 0.017306, 0.010939, 0.014717, 0.009269, 0.010845, 0.007143, 0.010367, 0.007076, 0.007895</max>
		</layer>
		<layer>
			<name>Convolution2</name>
			<min>-1.627248, -1.879835, -1.499959, -0.950082, -1.225428, -1.318004, -1.405691, -1.139071, -1.257685, -1.125481, -1.463716, -1.126113, -2.179467, -1.236589, -1.706463, -1.088633, -1.906270, -1.507580, -1.681309, -2.136898, -0.931076, -1.511141, -2.160564, -2.140985, -1.744365, -1.266984, -1.573157, -2.386214, -1.541101, -0.710579, -1.622023, -1.657851, -0.953741, -1.368269, -1.474924, -1.250470, -1.689122, -1.382821, -2.064487, -1.853759, -1.817030, -1.589537, -1.563278, -0.873991, -1.553625, -1.219569, -0.669748, -1.121973, -1.636577, -1.207969, -2.030607, -2.780858, -1.812889, -1.635600, -1.391387, -1.456479, -1.300750, -1.722949, -1.609031, -2.041896, -1.723965, -2.573943, -1.240377, -1.259734</min>
			<max>0.905205, 1.062459, 0.727956, 0.804191, 0.897707, 0.703056, 1.161918, 1.541996, 1.097404, 1.084027, 0.925163, 1.058370, 1.075587, 1.068236, 0.758609, 1.001391, 0.834067, 0.802896, 0.984749, 1.032563, 0.931093, 0.951976, 0.974851, 0.527045, 0.821263, 0.957803, 0.985535, 0.979618, 0.907223, 0.917161, 1.101120, 1.050624, 0.428557, 0.794043, 0.701409, 1.024507, 1.081997, 1.080552, 0.860098, 1.218092, 0.878788, 0.881746, 0.867059, 1.122631, 1.181540, 1.239741, 0.857372, 0.898606, 0.822879, 0.971006, 0.984975, 0.759440, 0.934764, 0.873548, 0.925514, 0.970118, 0.942599, 0.821828, 1.028504, 0.899409, 0.894519, 0.937373, 1.094654, 1.622820</max>
		</layer>
		<layer>
			<name>Convolution3</name>
			<min>-1.023798, -0.715578, -1.181075, -0.641407, -0.716198, -0.395597, -0.971761, -0.806774, -0.724465, -0.973453, -0.665456, -0.969476, -0.686646, -0.755464, -0.650227, -0.672444, -0.669694, -0.738331, -0.757712, -0.740575, -0.598845, -0.691326, -0.757324, -0.605380, -0.532786, -0.812603, -0.800361, -0.774611, -0.714800, -0.710087, -0.720306, -0.723742, -0.793305, -0.426284, -0.624242, -0.655124, -0.662621, -1.002799, -0.786555, -0.699257, -0.814455, -0.691789, -0.772849, -0.873802, -0.871010, -0.903213, -0.706481, -0.740179, -0.730555, -0.595757, -0.691282, -0.750183, -0.627721, -0.752022, -0.787962, -0.716592, -0.810367, -0.825676, -0.296439, -0.865324, -0.577025, -0.799344, -0.723974, -0.765407</min>
			<max>0.308817, 0.317753, 0.172143, 0.438146, 0.325185, 0.834096, 0.260142, 0.310324, 0.263950, 0.295492, 0.325349, 0.302362, 0.331788, 0.268909, 0.274095, 0.397285, 0.490183, 0.404362, 0.349854, 0.365898, 0.269283, 0.316064, 0.306233, 0.299157, 0.325448, 0.384374, 0.214193, 0.427106, 0.235776, 0.326620, 0.439096, 0.247278, 0.332415, 0.519262, 0.395198, 0.393954, 0.361710, 0.359076, 0.230810, 0.270222, 0.321387, 0.418769, 0.282706, 0.388068, 0.284442, 0.390795, 0.384356, 0.496994, 0.371822, 0.437568, 0.303823, 0.210093, 0.381582, 0.289581, 0.121387, 0.376769, 0.302714, 0.300787, 0.687664, 0.447795, 0.314238, 0.258976, 0.297355, 0.347093</max>
		</layer>
		<layer>
			<name>Convolution4</name>
			<min>-0.595438, -0.583100, -0.652486, -0.563603, -0.598568, -0.544452, -0.773512, -0.472180, -0.548812, -0.708514, -0.638092, -0.628945, -0.736440, -0.524062, -0.692535, -0.550217, -0.696735, -0.756644, -0.670378, -0.638849, -0.783023, -0.507868, -0.556107, -0.687082, -0.832292, -0.612189, -0.742343, -0.573653, -0.784104, -0.604170, -0.621181, -0.673388, -0.695524, -0.559410, -0.712047, -0.805891, -0.719078, -0.682001, -0.822950, -0.546778, -0.551911, -0.604012, -0.836025, -0.643851, -0.508570, -0.618484, -0.678134, -0.511676, -0.477302, -0.810583, -0.632277, -0.500915, -0.634326, -0.723632, -0.747355, -0.863162, -0.546478, -0.621996, -0.593237, -0.509499, -0.679904, -0.733458, -0.534625, -0.616903, -0.543030, -0.781035, -0.553359, -0.684239, -0.804870, -0.649996, -0.570415, -0.682816, -0.517122, -0.571050, -0.552527, -0.689352, -0.596631, -0.687869, -0.721954, -0.600751, -0.579274, -0.480631, -0.740381, -0.754580, -0.478050, -0.573430, -0.682844, -0.501217, -0.550458, -0.563274, -0.777844, -0.534323, -0.710359, -0.733309, -0.493696, -0.678150, -0.468323, -0.645505, -0.542045, -0.777346, -0.683569, -0.779443, -0.522868, -0.677924, -0.533055, -0.500468, -0.745567, -0.713733, -0.593300, -0.764049, -0.709381, -0.680766, -0.484120, -0.676960, -0.766189, -0.552389, -0.600093, -0.747793, -0.610404, -0.669567, -0.580715, -0.551658, -0.578284, -0.688096, -0.684017, -0.559547, -0.593577, -0.522383</min>
			<max>0.579576, 0.485203, 0.317064, 0.418410, 0.499715, 0.522450, 0.484808, 0.343832, 0.529939, 0.585467, 0.523933, 0.462464, 0.463677, 0.533538, 0.400563, 0.702001, 0.525388, 0.561216, 0.510233, 0.421827, 0.464887, 0.365188, 0.735847, 0.479555, 0.533124, 0.503533, 0.494785, 0.527861, 0.506193, 0.543423, 0.660038, 0.499352, 0.406038, 0.609842, 0.605423, 0.490304, 0.470722, 0.414112, 0.450010, 0.456960, 0.460435, 0.639722, 0.433611, 0.478214, 0.570836, 0.655848, 0.604670, 0.551581, 0.608559, 0.567928, 0.525707, 0.479639, 0.508027, 0.430890, 0.419804, 0.656867, 0.715547, 0.530847, 0.465678, 0.524120, 0.601507, 0.583027, 0.483653, 0.389539, 0.653262, 0.346715, 0.755781, 0.645846, 0.720553, 0.519095, 0.522778, 0.547423, 0.360575, 0.534512, 0.643116, 0.551878, 0.494507, 0.595880, 0.515459, 0.568319, 0.645250, 0.551388, 0.550018, 0.476521, 0.460315, 0.673013, 0.348942, 0.433958, 0.751396, 0.378837, 0.456776, 0.536936, 0.441102, 0.507293, 0.431674, 0.714188, 0.792893, 0.790065, 0.640562, 0.600197, 0.561595, 0.451155, 0.473471, 0.574157, 0.605994, 0.471646, 0.528151, 0.617134, 0.577579, 0.483731, 0.561533, 0.359120, 0.362864, 0.397107, 0.515059, 0.797294, 0.510792, 0.577589, 0.579656, 0.679054, 0.419776, 0.402950, 0.490185, 0.498838, 0.571820, 0.507891, 0.493759, 0.376153</max>
		</layer>
		<layer>
			<name>Convolution5</name>
			<min>-0.126897, -0.160909, -0.265940, -0.270227, -0.211453, -0.236429, -0.217917, -0.194349, -0.241350, -0.264687, -0.284774, -0.198957, -0.318626, -0.205976, -0.271433, -0.185176, -0.286982, -0.273526, -0.200423, -0.237691, -0.176330, -0.228416, -0.226399, -0.166696, -0.214531, -0.270351, -0.215533, -0.241809, -0.215279, -0.255869, -0.168770, -0.257081, -0.227173, -0.241236, -0.186629, -0.216300, -0.225357, -0.194459, -0.254644, -0.275651, -0.273946, -0.207266, -0.248816, -0.261985, -0.195551, -0.224481, -0.267779, -0.300037, -0.239656, -0.221217, -0.202991, -0.214001, -0.233293, -0.183185, -0.233302, -0.230911, -0.228963, -0.314136, -0.179801, -0.217217, -0.258301, -0.221509, -0.215881, -0.237211, -0.226171, -0.226988, -0.242470, -0.250583, -0.276211, -0.237760, -0.197183, -0.163228, -0.158538, -0.291260, -0.277555, -0.248066, -0.220694, -0.186232, -0.254915, -0.204881, -0.290774, -0.238805, -0.294386, -0.187586, -0.200367, -0.177406, -0.257055, -0.209295, -0.259496, -0.192962, -0.233108, -0.239267, -0.253036, -0.180762, -0.264754, -0.219800, -0.245018, -0.122131, -0.223870, -0.163257, -0.232329, -0.134345, -0.286151, -0.230436, -0.199482, -0.240634, -0.225717, -0.194831, -0.208216, -0.252793, -0.193196, -0.162670, -0.259410, -0.234081, -0.233284, -0.202844, -0.175269, -0.243827, -0.186333, -0.218765, -0.260085, -0.212105, -0.250760, -0.191922, -0.241942, -0.163614, -0.206260, -0.231079</min>
			<max>0.203724, 0.190753, 0.101158, 0.093999, 0.136404, 0.101925, 0.137773, 0.119753, 0.121617, 0.144806, 0.133970, 0.129607, 0.081842, 0.112639, 0.101117, 0.127954, 0.125375, 0.087241, 0.137037, 0.088219, 0.130068, 0.142928, 0.120164, 0.146220, 0.156110, 0.139343, 0.103238, 0.134484, 0.152456, 0.106810, 0.147065, 0.113992, 0.150281, 0.114618, 0.152371, 0.122720, 0.155171, 0.148506, 0.119944, 0.073364, 0.128436, 0.149063, 0.136874, 0.102479, 0.129887, 0.083580, 0.123741, 0.083499, 0.127262, 0.122497, 0.121919, 0.146306, 0.148711, 0.183274, 0.121410, 0.125226, 0.099083, 0.103119, 0.152381, 0.130106, 0.130724, 0.108136, 0.176401, 0.112311, 0.118442, 0.105875, 0.125080, 0.102131, 0.110879, 0.101198, 0.127261, 0.161497, 0.235551, 0.078536, 0.102004, 0.130658, 0.159826, 0.138183, 0.093220, 0.259927, 0.118586, 0.163288, 0.110634, 0.177871, 0.097956, 0.153076, 0.130068, 0.130505, 0.120075, 0.153099, 0.086499, 0.137217, 0.124613, 0.124552, 0.117444, 0.144079, 0.114998, 0.215422, 0.107925, 0.157091, 0.101492, 0.228064, 0.125019, 0.163587, 0.171148, 0.141334, 0.124045, 0.143291, 0.135648, 0.151771, 0.176231, 0.162938, 0.157849, 0.143144, 0.158371, 0.141309, 0.163775, 0.068875, 0.163456, 0.095763, 0.149821, 0.168991, 0.114055, 0.165185, 0.117363, 0.176812, 0.148621, 0.125047</max>
		</layer>
		<layer>
			<name>Convolution6</name>
			<min>-0.021052, -0.031785, -0.051554, -0.031931, -0.037570, -0.024858, -0.044520, -0.041543, -0.037186, -0.027566, -0.027871, -0.031775, -0.048787, -0.037781, -0.040168, -0.025542, -0.033036, -0.024823, -0.035039, -0.045910, -0.018414, -0.036255, -0.026471, -0.028962, -0.040206, -0.052485, -0.041309, -0.034921, -0.052950, -0.040905, -0.020675, -0.037812, -0.046197, -0.051744, -0.045049, -0.021696, -0.042038, -0.005659, -0.021555, -0.044189, -0.032880, -0.039178, -0.037886, -0.029288, -0.027422, -0.027230, -0.050443, -0.031421, -0.042107, -0.029265, -0.023100, -0.037297, -0.048852, -0.035644, -0.022874, -0.033750, -0.032625, -0.054753, -0.035883, -0.034017, -0.032872, -0.034911, -0.053081, -0.039955, -0.039641, -0.037230, -0.025195, -0.026680, -0.030164, -0.037467, -0.039524, -0.023282, -0.024399, -0.047387, -0.029835, -0.019298, -0.035063, -0.026188, -0.030231, -0.035388, -0.023599, -0.027500, -0.033206, -0.017046, -0.032706, -0.031711, -0.046230, -0.046122, -0.021012, -0.027255, -0.045827, -0.034681, -0.023156, -0.020798, -0.028407, -0.027143, -0.038337, -0.034519, -0.036698, -0.020792, -0.021810, -0.031591, -0.036206, -0.038481, -0.027650, -0.025287, -0.054417, -0.036755, -0.034131, -0.033264, -0.027441, -0.014501, -0.032014, -0.034446, -0.027702, -0.025137, -0.038716, -0.028341, -0.027999, -0.029886, -0.041702, -0.037037, -0.028632, -0.028103, -0.026354, -0.020011, -0.037888, -0.030149</min>
			<max>0.041521, 0.024565, 0.011309, 0.014078, 0.014368, 0.023726, 0.013547, 0.020550, 0.025236, 0.019298, 0.024950, 0.034242, 0.005991, 0.011575, 0.041344, 0.023179, 0.028413, 0.040597, 0.013758, 0.022222, 0.022352, 0.027975, 0.025047, 0.026074, 0.030138, 0.008578, 0.020022, 0.031894, 0.026464, 0.013632, 0.031782, 0.015816, 0.009159, 0.007709, 0.024424, 0.030073, 0.010063, 0.049891, 0.022370, 0.024547, 0.032830, 0.021620, 0.022844, 0.021844, 0.032761, 0.020873, 0.012797, 0.018006, 0.014913, 0.028986, 0.012706, 0.016733, 0.016625, 0.025113, 0.022338, 0.012973, 0.022277, 0.015881, 0.021683, 0.017673, 0.023045, 0.038102, 0.013240, 0.025591, 0.023650, 0.016661, 0.040482, 0.028083, 0.016869, 0.018714, 0.015001, 0.048245, 0.016218, 0.014013, 0.035090, 0.044191, 0.015437, 0.022479, 0.032609, 0.031725, 0.036348, 0.018826, 0.018858, 0.040491, 0.047601, 0.022067, 0.030028, 0.025627, 0.034041, 0.034601, 0.015533, 0.030121, 0.025560, 0.031050, 0.016223, 0.022714, 0.018075, 0.023434, 0.014435, 0.032223, 0.028759, 0.016795, 0.019995, 0.032643, 0.018484, 0.024325, 0.029560, 0.015058, 0.020098, 0.031966, 0.034650, 0.036497, 0.029708, 0.011855, 0.045515, 0.026832, 0.020536, 0.016649, 0.023351, 0.022306, 0.017162, 0.020832, 0.018565, 0.015498, 0.017714, 0.038949, 0.009664, 0.024469</max>
		</layer>
		<layer>
			<name>Convolution7</name>
