<?xml version="1.0" ?>
<net batch="1" name="20180408-102900" version="6">
	<layers>
		<layer id="0" name="image_batch/placeholder_port_0" precision="FP16" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Mul1_/Fused_Mul_/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="6"/>
				<biases offset="6" size="6"/>
			</blobs>
		</layer>
		<layer id="2" name="InceptionResnetV1/Conv2d_1a_3x3/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>79</dim>
				</port>
			</output>
			<blobs>
				<weights offset="12" size="1728"/>
				<biases offset="1740" size="64"/>
			</blobs>
		</layer>
		<layer id="3" name="InceptionResnetV1/Conv2d_1a_3x3/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="InceptionResnetV1/Conv2d_2a_3x3/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1804" size="18432"/>
				<biases offset="20236" size="64"/>
			</blobs>
		</layer>
		<layer id="5" name="InceptionResnetV1/Conv2d_2a_3x3/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="InceptionResnetV1/Conv2d_2b_3x3/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
			<blobs>
				<weights offset="20300" size="36864"/>
				<biases offset="57164" size="128"/>
			</blobs>
		</layer>
		<layer id="7" name="InceptionResnetV1/Conv2d_2b_3x3/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="InceptionResnetV1/MaxPool_3a_3x3/MaxPool" precision="FP16" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="InceptionResnetV1/Conv2d_3b_1x1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="80" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<weights offset="57292" size="10240"/>
				<biases offset="67532" size="160"/>
			</blobs>
		</layer>
		<layer id="10" name="InceptionResnetV1/Conv2d_3b_1x1/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="InceptionResnetV1/Conv2d_4a_3x3/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="3,3" output="192" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</output>
			<blobs>
				<weights offset="67692" size="276480"/>
				<biases offset="344172" size="384"/>
			</blobs>
		</layer>
		<layer id="12" name="InceptionResnetV1/Conv2d_4a_3x3/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="InceptionResnetV1/Conv2d_4b_3x3/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="344556" size="884736"/>
				<biases offset="1229292" size="512"/>
			</blobs>
		</layer>
		<layer id="14" name="InceptionResnetV1/Conv2d_4b_3x3/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1229804" size="16384"/>
				<biases offset="1246188" size="64"/>
			</blobs>
		</layer>
		<layer id="16" name="InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1246252" size="16384"/>
				<biases offset="1262636" size="64"/>
			</blobs>
		</layer>
		<layer id="18" name="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1262700" size="18432"/>
				<biases offset="1281132" size="64"/>
			</blobs>
		</layer>
		<layer id="20" name="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1281196" size="16384"/>
				<biases offset="1297580" size="64"/>
			</blobs>
		</layer>
		<layer id="22" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1297644" size="18432"/>
				<biases offset="1316076" size="64"/>
			</blobs>
		</layer>
		<layer id="24" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1316140" size="18432"/>
				<biases offset="1334572" size="64"/>
			</blobs>
		</layer>
		<layer id="26" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="InceptionResnetV1/Repeat/block35_1/concat" precision="FP16" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="InceptionResnetV1/Repeat/block35_1/Conv2d_1x1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1334636" size="49152"/>
				<biases offset="1383788" size="512"/>
			</blobs>
		</layer>
		<layer id="29" name="InceptionResnetV1/Repeat/block35_1/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="InceptionResnetV1/Repeat/block35_1/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="InceptionResnetV1/Repeat/block35_2/Branch_0/Conv2d_1x1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1384300" size="16384"/>
				<biases offset="1400684" size="64"/>
			</blobs>
		</layer>
		<layer id="32" name="InceptionResnetV1/Repeat/block35_2/Branch_0/Conv2d_1x1/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0a_1x1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1400748" size="16384"/>
				<biases offset="1417132" size="64"/>
			</blobs>
		</layer>
		<layer id="34" name="InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0a_1x1/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0b_3x3/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1417196" size="18432"/>
				<biases offset="1435628" size="64"/>
			</blobs>
		</layer>
		<layer id="36" name="InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0b_3x3/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0a_1x1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1435692" size="16384"/>
				<biases offset="1452076" size="64"/>
			</blobs>
		</layer>
		<layer id="38" name="InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0a_1x1/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0b_3x3/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1452140" size="18432"/>
				<biases offset="1470572" size="64"/>
			</blobs>
		</layer>
		<layer id="40" name="InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0b_3x3/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0c_3x3/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1470636" size="18432"/>
				<biases offset="1489068" size="64"/>
			</blobs>
		</layer>
		<layer id="42" name="InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0c_3x3/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="InceptionResnetV1/Repeat/block35_2/concat" precision="FP16" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="InceptionResnetV1/Repeat/block35_2/Conv2d_1x1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1489132" size="49152"/>
				<biases offset="1538284" size="512"/>
			</blobs>
		</layer>
		<layer id="45" name="InceptionResnetV1/Repeat/block35_2/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="InceptionResnetV1/Repeat/block35_2/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="InceptionResnetV1/Repeat/block35_3/Branch_0/Conv2d_1x1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1538796" size="16384"/>
				<biases offset="1555180" size="64"/>
			</blobs>
		</layer>
		<layer id="48" name="InceptionResnetV1/Repeat/block35_3/Branch_0/Conv2d_1x1/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="InceptionResnetV1/Repeat/block35_3/Branch_1/Conv2d_0a_1x1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1555244" size="16384"/>
				<biases offset="1571628" size="64"/>
			</blobs>
		</layer>
		<layer id="50" name="InceptionResnetV1/Repeat/block35_3/Branch_1/Conv2d_0a_1x1/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="InceptionResnetV1/Repeat/block35_3/Branch_1/Conv2d_0b_3x3/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1571692" size="18432"/>
				<biases offset="1590124" size="64"/>
			</blobs>
		</layer>
		<layer id="52" name="InceptionResnetV1/Repeat/block35_3/Branch_1/Conv2d_0b_3x3/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="InceptionResnetV1/Repeat/block35_3/Branch_2/Conv2d_0a_1x1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1590188" size="16384"/>
				<biases offset="1606572" size="64"/>
			</blobs>
		</layer>
		<layer id="54" name="InceptionResnetV1/Repeat/block35_3/Branch_2/Conv2d_0a_1x1/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="InceptionResnetV1/Repeat/block35_3/Branch_2/Conv2d_0b_3x3/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1606636" size="18432"/>
				<biases offset="1625068" size="64"/>
			</blobs>
		</layer>
		<layer id="56" name="InceptionResnetV1/Repeat/block35_3/Branch_2/Conv2d_0b_3x3/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="InceptionResnetV1/Repeat/block35_3/Branch_2/Conv2d_0c_3x3/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1625132" size="18432"/>
				<biases offset="1643564" size="64"/>
			</blobs>
		</layer>
		<layer id="58" name="InceptionResnetV1/Repeat/block35_3/Branch_2/Conv2d_0c_3x3/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="InceptionResnetV1/Repeat/block35_3/concat" precision="FP16" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="InceptionResnetV1/Repeat/block35_3/Conv2d_1x1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1643628" size="49152"/>
				<biases offset="1692780" size="512"/>
			</blobs>
		</layer>
		<layer id="61" name="InceptionResnetV1/Repeat/block35_3/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="InceptionResnetV1/Repeat/block35_3/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="InceptionResnetV1/Repeat/block35_4/Branch_0/Conv2d_1x1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1693292" size="16384"/>
				<biases offset="1709676" size="64"/>
			</blobs>
		</layer>
		<layer id="64" name="InceptionResnetV1/Repeat/block35_4/Branch_0/Conv2d_1x1/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="InceptionResnetV1/Repeat/block35_4/Branch_1/Conv2d_0a_1x1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1709740" size="16384"/>
				<biases offset="1726124" size="64"/>
			</blobs>
		</layer>
		<layer id="66" name="InceptionResnetV1/Repeat/block35_4/Branch_1/Conv2d_0a_1x1/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="InceptionResnetV1/Repeat/block35_4/Branch_1/Conv2d_0b_3x3/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1726188" size="18432"/>
				<biases offset="1744620" size="64"/>
			</blobs>
		</layer>
		<layer id="68" name="InceptionResnetV1/Repeat/block35_4/Branch_1/Conv2d_0b_3x3/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="InceptionResnetV1/Repeat/block35_4/Branch_2/Conv2d_0a_1x1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1744684" size="16384"/>
				<biases offset="1761068" size="64"/>
			</blobs>
		</layer>
		<layer id="70" name="InceptionResnetV1/Repeat/block35_4/Branch_2/Conv2d_0a_1x1/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="InceptionResnetV1/Repeat/block35_4/Branch_2/Conv2d_0b_3x3/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1761132" size="18432"/>
				<biases offset="1779564" size="64"/>
			</blobs>
		</layer>
		<layer id="72" name="InceptionResnetV1/Repeat/block35_4/Branch_2/Conv2d_0b_3x3/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="InceptionResnetV1/Repeat/block35_4/Branch_2/Conv2d_0c_3x3/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1779628" size="18432"/>
				<biases offset="1798060" size="64"/>
			</blobs>
		</layer>
		<layer id="74" name="InceptionResnetV1/Repeat/block35_4/Branch_2/Conv2d_0c_3x3/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="InceptionResnetV1/Repeat/block35_4/concat" precision="FP16" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="InceptionResnetV1/Repeat/block35_4/Conv2d_1x1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1798124" size="49152"/>
				<biases offset="1847276" size="512"/>
			</blobs>
		</layer>
		<layer id="77" name="InceptionResnetV1/Repeat/block35_4/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="InceptionResnetV1/Repeat/block35_4/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="InceptionResnetV1/Repeat/block35_5/Branch_0/Conv2d_1x1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1847788" size="16384"/>
				<biases offset="1864172" size="64"/>
			</blobs>
		</layer>
		<layer id="80" name="InceptionResnetV1/Repeat/block35_5/Branch_0/Conv2d_1x1/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="InceptionResnetV1/Repeat/block35_5/Branch_1/Conv2d_0a_1x1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1864236" size="16384"/>
				<biases offset="1880620" size="64"/>
			</blobs>
		</layer>
		<layer id="82" name="InceptionResnetV1/Repeat/block35_5/Branch_1/Conv2d_0a_1x1/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="InceptionResnetV1/Repeat/block35_5/Branch_1/Conv2d_0b_3x3/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1880684" size="18432"/>
				<biases offset="1899116" size="64"/>
			</blobs>
		</layer>
		<layer id="84" name="InceptionResnetV1/Repeat/block35_5/Branch_1/Conv2d_0b_3x3/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="InceptionResnetV1/Repeat/block35_5/Branch_2/Conv2d_0a_1x1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1899180" size="16384"/>
				<biases offset="1915564" size="64"/>
			</blobs>
		</layer>
		<layer id="86" name="InceptionResnetV1/Repeat/block35_5/Branch_2/Conv2d_0a_1x1/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="InceptionResnetV1/Repeat/block35_5/Branch_2/Conv2d_0b_3x3/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1915628" size="18432"/>
				<biases offset="1934060" size="64"/>
			</blobs>
		</layer>
		<layer id="88" name="InceptionResnetV1/Repeat/block35_5/Branch_2/Conv2d_0b_3x3/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="InceptionResnetV1/Repeat/block35_5/Branch_2/Conv2d_0c_3x3/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1934124" size="18432"/>
				<biases offset="1952556" size="64"/>
			</blobs>
		</layer>
		<layer id="90" name="InceptionResnetV1/Repeat/block35_5/Branch_2/Conv2d_0c_3x3/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="InceptionResnetV1/Repeat/block35_5/concat" precision="FP16" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="InceptionResnetV1/Repeat/block35_5/Conv2d_1x1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1952620" size="49152"/>
				<biases offset="2001772" size="512"/>
			</blobs>
		</layer>
		<layer id="93" name="InceptionResnetV1/Repeat/block35_5/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="InceptionResnetV1/Repeat/block35_5/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="InceptionResnetV1/Mixed_6a/Branch_0/Conv2d_1a_3x3/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="3,3" output="384" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>384</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2002284" size="1769472"/>
				<biases offset="3771756" size="768"/>
			</blobs>
		</layer>
		<layer id="96" name="InceptionResnetV1/Mixed_6a/Branch_0/Conv2d_1a_3x3/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="InceptionResnetV1/Mixed_6a/Branch_1/Conv2d_0a_1x1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3772524" size="98304"/>
				<biases offset="3870828" size="384"/>
			</blobs>
		</layer>
		<layer id="98" name="InceptionResnetV1/Mixed_6a/Branch_1/Conv2d_0a_1x1/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>17</dim>
